spec/fixtures/files/stripe_events_list_gift_card.json

{
    "data": [
        {
            "api_version": "2018-05-21",
            "created": 1541249896,
            "data": {
                "object": {
                    "amount": 22000,
                    "amount_refunded": 0,
                    "application": null,
                    "application_fee": null,
                    "balance_transaction": "txn_1DSOhgHwuhGySQCdbrszdsyi",
                    "captured": true,
                    "created": 1541249895,
                    "currency": "sek",
                    "customer": null,
                    "description": "Gift Card 3 months",
                    "destination": null,
                    "dispute": null,
                    "failure_code": null,
                    "failure_message": null,
                    "fraud_details": {},
                    "id": "ch_1DSOhfHwuhGySQCdlVpJYYwn",
                    "invoice": null,
                    "livemode": false,
                    "metadata": {},
                    "object": "charge",
                    "on_behalf_of": null,
                    "order": null,
                    "outcome": {
                        "network_status": "approved_by_network",
                        "reason": null,
                        "risk_level": "normal",
                        "risk_score": 49,
                        "seller_message": "Payment complete.",
                        "type": "authorized"
                    },
                    "paid": true,
                    "payment_intent": null,
                    "receipt_email": null,
                    "receipt_number": null,
                    "refunded": false,
                    "refunds": {
                        "data": [],
                        "has_more": false,
                        "object": "list",
                        "total_count": 0,
                        "url": "/v1/charges/ch_1DSOhfHwuhGySQCdlVpJYYwn/refunds"
                    },
                    "review": null,
                    "shipping": null,
                    "source": {
                        "address_city": null,
                        "address_country": null,
                        "address_line1": null,
                        "address_line1_check": null,
                        "address_line2": null,
                        "address_state": null,
                        "address_zip": null,
                        "address_zip_check": null,
                        "brand": "Visa",
                        "country": "US",
                        "customer": null,
                        "cvc_check": "pass",
                        "dynamic_last4": null,
                        "exp_month": 11,
                        "exp_year": 2019,
                        "fingerprint": "AFDR1kTX598pXWiQ",
                        "funding": "credit",
                        "id": "card_1DSOhcHwuhGySQCdqmQcEMmx",
                        "last4": "4242",
                        "metadata": {},
                        "name": "kalle.nilver@gmail.com",
                        "object": "card",
                        "tokenization_method": null
                    },
                    "source_transfer": null,
                    "statement_descriptor": null,
                    "status": "succeeded",
                    "transfer_group": null
                }
            },
            "id": "evt_1DSOhgHwuhGySQCdbfGo5Bsz",
            "livemode": false,
            "object": "event",
            "pending_webhooks": 0,
            "request": {
                "id": "req_39TIfEf7bRrdY8",
                "idempotency_key": null
            },
            "type": "charge.succeeded"
        }
    ],
    "object": "list"
}
